[
    {
        "name": "FREERTOS",
        "description": "Indicates that FREERTOS is enabled and being used."
    },
    {
        "name": "CM33",
        "description" : "Indicates this is code running on the CM33 processor"
    },
    {
        "name" : "CM33_0",
        "description" : "Indicates this is code running on the first CM33 processor"
    },
    {
        "name" : "CAT1",
        "description" : "Indicates this device is a category 1 device. The categories are defined by Infineon and are used to group similiar devices or device families together."
    },
    {
        "name" : "CAT1A",
        "description" : "Indicates this device is a category 1 device from the PSOC 6 family."
    },    
    {
        "name" : "CAT1D",
        "description" : "Indicates this device is a category 1 device from the PSOC Edge family."
    },
    {
        "name" : "CM0P_SLEEP",
        "description" : "Indicates this is application is running on a PSOC 6 device but is only using the Cortex M4 processor.  After initialization of the system, the Cortex M0+ processor is in sleep mode."
    },    
    {
        "name" : "CM4",
        "description" : "Indicates this is code running on the CM4 processor"
    },
    {
        "name" : "CM4_0",
        "description" : "Indicates this is code running on the first CM4 processor if there are multiple CM4 processors."
    },
    {
        "name" : "HCI-UART",
        "description" : "Indicates this code is using the HCI-UART protocol to communicate with a BLE/Bluetooth wireless device."
    },
    {
        "name" : "MURATA-1YN",
        "description" : "Indicates this code assuming the use of the Murata 1Y module, which support both BLE and Wi-Fi."
    },
    {
        "name" : "LWIP",
        "description" : "Indicates this is code using the Lightweight IP (LWIP) stack."
    },
    {
        "name" : "MBEDTLS",
        "description": "Indicates this codeis using the MBEDTLS library from Arm"
    },
    {
        "name" : "Debug",
        "description": "Indicates this code is being built for debugging.  This will include debug symbols and other information to assist in debugging the code."  
    },
    {
        "name" : "Release",
        "description": "Indicates this code is being built for release.  This will include optimizations and other changes to improve performance and reduce size."
    },
    {
        "name" : "GCC_ARM",
        "description": "Indicates this code is being built using the GCC ARM toolchain."
    },
    {
        "name" : "55500",
        "description": "Indicates this code is being built to work with a 55500 wireless device."
    },
    {
        "name": "55500A1",
        "description": "Indicates this code is being built to work with a 55500A1 wireless device."
    },
    {
        "name": "4343W",
        "description": "Indicates this code is being built to work with a 4343W wireless device."
    },
    {
        "name": "43439",
        "description": "Indicates this code is being built to work with a 43439 wireless device."
    }
]
